Repository: Maisam142/VirtAm
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Select Language
ar: اختيار اللغة

source: Arabic
ar: العربية

source: English
ar: انجليزي

# createYourVirtAm
source: Create your VirtAm id
ar: قم بإنشاء معرف VirtAm الخاص بك

# createYourVirtAmSmallText
source: You will get 90 days free trial on creating new account. Make sure you use correct information
ar: سوف تحصل على نسخة تجريبية مجانية مدتها 90 يومًا عند إنشاء حساب جديد. تأكد من استخدام المعلومات الصحيحة

source: Login
ar: تسجيل الدخول

source: Sign In
ar: تسجيل الدخول

# forgetPass
source: Forgot the password?
ar: نسيت كلمة السر ؟

# signedAlready
source: Your VirtAm account is now VirtAm ID. If youâ€™ve signed into the app before, use the same credentials here. otherwise
ar: حساب VirtAm الخاص بك أصبح الآن معرف VirtAm. إذا قمت بتسجيل الدخول إلى التطبيق من قبل، فاستخدم نفس بيانات الاعتماد هنا. بخلاف ذلك

source: Full Name :
ar: الاسم الكامل

# email
source: Email Address :
ar: عنوان البريد الإلكتروني

# existEmail
source: Email Already Exists
ar: البريد الإلكتروني موجود بالفعل

# errorExistEmail
source: The email address you provided is already registered. Please use a different email address.
ar: البريد الإلكتروني الذي قدمته مسجل بالفعل. يرجى استخدام عنوان بريد إلكتروني مختلف.

source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة المرور

# rePassword
source: Re-write Password
ar: إعادة كتابة كلمة المرور

# shouldContain
source: password should contain :
ar: يجب أن تحتوي كلمة المرور على:

# condition1
source: At least one letter
ar: حرف واحد على الأقل

# condition2
source: At least one uppercase letter
ar: حرف كبير واحد على الأقل

# condition3
source: At least one number
ar: رقم واحد على الأقل

# condition4
source: At least eight characters
ar: ثمانية أحرف على الأقل

# condition5
source: At least one special character
ar: حرف خاص واحد على الأقل

# purpose
source: The purpose of creating the account?
ar: هدف إنشاء الحساب؟

# purpose1
source: Follow my personal data
ar: متابعة بياناتي الشخصية

# purpose2
source: Follow up with my nutrition counselor
ar: متابعة مستشار التغذية الخاص بي

# purpose3
source: Find a nutrition counselor in my area
ar: العثور على مستشار تغذية في منطقتي

# agree
source: I agree to the Terms and Privacy Policy
ar: أوافق على الشروط وسياسة الخصوصية

# noteReg
source: By agreeing to the above terms, you are consenting that your personal information will be collected, stored, and processed
ar: بالموافقة على الشروط أعلاه، فإنك توافق على أن يتم جمع معلوماتك الشخصية وتخزينها ومعالجتها.

# step1
source: Step 1/10
ar: الخطوة 1/10

source: What is your
ar: ما هو ؟

source: age ?
ar: عمرك؟

source: Years
ar: سنوات

source: Weight ?
ar: وزنك؟

source: Kg
ar: كغ

source: Height ?
ar: طولك؟

source: Cm
ar: سم

# step2
source: Step 2/10
ar: الخطوة 2/10

# hasAllergic
source: Is he allergic to :
ar: هل لديه حساسية لـ:

source: Eggs
ar: البيض

source: Milk
ar: الحليب

source: Fish
ar: السمك

# step3
source: Step 3/10
ar: الخطوة 3/10

# thyroidCheckedTime
source: When was the last time you had your thyroid checked?
ar: متى كان آخر مرة قمت بفحص الغدة الدرقية؟

source: Less than 90 days
ar: أقل من 90 يومًا

source: last 3 months
ar: آخر 3 أشهر

source: last 6 months
ar: آخر 6 أشهر

# more6Months
source: more than 6 months
ar: أكثر من 6 أشهر

# thyroidProblems
source: Does he have thyroid problems?
ar: هل لديه مشاكل في الغدة الدرقية؟

source: Yes
ar: نعم

source: No
ar: لا

# dontKnow
source: I Don't Know
ar: لا أعلم

# step4
source: Step 4/10
ar: الخطوة 4/10

# ironCheck
source: When did you last check the iron?
ar: متى كانت آخر مرة قمت بفحص الحديد؟

# ironDeficiency
source: Does he/she have an iron deficiency?
ar: هل لديه/لديها نقص في الحديد؟

# step5
source: Step 5/10
ar: الخطوة 5/10

# vitaminDChecked
source: When was the last time you checked your vitamin D?
ar: متى كانت آخر مرة قمت بفحص فيتامين د؟

# vitaminDDeficiency
source: Does he/she have a vitamin D deficiency?
ar: هل لديه/لديها نقص فيتامين د؟

# step6
source: Step 6/10
ar: الخطوة 6/10

# vitaminB12Checked
source: When was the last time you checked your vitamin B12?
ar: متى كانت آخر مرة قمت بفحص فيتامين ب12؟

# vitaminB12Deficiency
source: Does he have a vitamin B12 deficiency?
ar: هل يعاني من نقص فيتامين ب12؟

# step7
source: Step 7/10
ar: الخطوة 7/10

# employeeWorker
source: Are you an employee/worker?
ar: هل أنت موظف / عامل؟

# step8
source: Step 8/10
ar: الخطوة 8/10

# work
source: Nature of work?
ar: طبيعة العمل؟

source: Office
ar: مكتبي

source: Field
ar: ميداني

# step9
source: Step 9/10
ar: الخطوة 9/10

# wakeUp
source: When do you wake up every day?
ar: متى تستيقظ كل يوم؟

# step10
source: Step 10/10
ar: الخطوة 10/10

# bedtime
source: When is your daily bedtime?
ar: متى تنام كل يوم؟

source: Next
ar: التالي

source: Complete Login
ar: اكمال تسجيل الدخول

# nutritionName
source: Name of the nutrition consultant you follow up with?
ar: اسم مستشار التغذية الذي تتابع معه؟

# consultantName
source: nutrition consultant name
ar: اسم مستشار التغذية

source: Location Name
ar: اسم الموقع

# stepGoal
source: Steps Goal: 10000
ar: هدف الخطوات: 10000

source: Calories
ar: سعرات حرارية

source: date
ar: التاريخ

source: Time
ar: الوقت

source: Distance
ar: المسافة

# duringFast
source: During a fast, water is the only drink allowed.
ar: خلال الصوم، يُسمح فقط بشرب الماء.

source: Weight History
ar: سجل الوزن

# remainingMl
source: remaining 603 ml
ar: المتبقي 603 مل

source: Add
ar: إضافة

source: Exercise
ar: تمرين

# play
source: Play Now
ar: ابدأ الآن

source: View All
ar: عرض الكل

# CalorieCalc
source: Calorie calculator
ar: حاسب السعرات الحرارية

source: Remaining
ar: المتبقي

source: ml
ar: مل

# remainingml
source: Remaining:
ar: المتبقي:

source: Proteina
ar: بروتين

source: Carbohydrates
ar: الكربوهيدرات

# fast
source: Fats
ar: دهون

source: Add Breakfast
ar: إضافة وجبة الإفطار

# recommended
source: recommended .767-1024
ar: الموصى به 0.767-1024

source: Add Lunch
ar: إضافة وجبة الغداء

source: Add Dinner
ar: إضافة وجبة العشاء

source: Add Snack
ar: إضافة وجبة خفيفة

# nutritionCenters
source: Nutrition and slimming centers
ar: مراكز التغذية والتخسيس

source: Search
ar: بحث

source: Popular Center
ar: أشهر المراكز

source: All Center
ar: كل المراكز

# changePic
source: Change Picture
ar: تغيير الصورة

source: Update
ar: تحديث

# updated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Drink Water
ar: اشرب الماء

# customGoal
source: custom water goal
ar: هدف مخصص للماء

# target
source: The Target
ar: الهدف

source: Settings
ar: الإعدادات

# waterGoal
source: Water Drinking Goal
ar: هدف شرب الماء

# habitSetting
source: Habit Settings
ar: إعدادات العادات

source: Hours
ar: ساعات

# remainingTime
source: remaining: 13:00 h
ar: الوقت المتبقي: 13:00 ساعة

# start
source: Start Time
ar: وقت البدء

# end
source: End Time
ar: وقت الانتهاء

# instructions
source: Instructions for when to fast
ar: تعليمات متى تصوم

source: Break Fast
ar: قطع الصيام

# wightHistory
source: Name - wight history
ar: سجل الوزن

# wightKg
source: Weight(kg)
ar: الوزن (كغ)

source: Fat
ar: الدهون

source: Exercises
ar: التمارين

source: Lorem
ar: لوريم

source: Fitness
ar: اللياقة البدنية

source: Calories Goal
ar: هدف السعرات الحرارية

# mealNum
source: Meal Numbers
ar: عدد الوجبات

source: About VirAm
ar: حول VirAm

# termsCondition
source: Terms and Conditions
ar: الشروط والأحكام

source: Subscription
ar: الاشتراك

# month5
source: 5 JOD / Month
ar: 5 دينار أردني / الشهر

# year5
source: 5 JOD / Year
ar: 5 دينار أردني / السنة

# free
source: virtAm is free for the first 90 days for every person
ar: VirtAm مجاني للأشخاص الجدد لمدة 90 يومًا الأولى

source: Notification
ar: الإشعارات

source: Today
ar: اليوم

# reminderToDrink
source: Reminder to drink water
ar: تذكير بشرب الماء

source: Yesterday
ar: أمس

# choose
source: You Should Choose !
ar: يجب أن تختار !

# chooseWhy
source: You Should Choose The Purpose of Creating Account ..
ar: يجب أن تختارالهدف من انشاء الحساب ..

source: Done
ar: تم

source: OR
ar: أو

source: Create Account
ar: انشاء حساب

source: Fast Time
ar: وقت الصيام

# whenStartFast
source: When did you start fasting ?
ar: متى بدأت الصيام؟

# whenEndFast
source: When did you end fasting ?
ar: متى انتهيت من الصيام؟

# breakingFast
source: Breaking Fasting
ar: كسر الصيام

# breakFastInstructions
source: Instructions to break fast
ar: تعليمات كسر الصيام

source: Edit Fast Time
ar: تعديل وقت الصيام

# addDailyMeal
source: Add Daily Meals
ar: إضافة وجبات يومية

# addDailyMealForMembers
source: Add daily meals for your Members :
ar: إضافة وجبات يومية لأعضائك:

source: Meal Name
ar: اسم الوجبة

source: Add First Type
ar: إضافة النوع الأول

source: Describe First Type
ar: وصف النوع الأول

source: Select Members
ar: اختيار الأعضاء

source: Add Second Type
ar: إضافة النوع الثاني

source: Add Exercise
ar: إضافة تمرين

# sendExercise
source: The center send exercise members:
ar: المركز يرسل تمارين للأعضاء:

source: Exercise Name:
ar: اسم التمرين:

source: Member Number
ar: رقم العضو

source: All Members
ar: جميع الأعضاء

source: Number of Members
ar: عدد الأعضاء

source: Admins
ar: المشرفون

source: Member Activity
ar: نشاط الأعضاء

source: Send Notification
ar: إرسال إشعار

# adminName
source: Amin Name
ar: اسم المشرف

source: Weight Before:
ar: الوزن قبل:

source: Weight After:
ar: الوزن بعد:

# centerSendNotification
source: The center send reminder notification for members:
ar: يُرسل المركز تذكيرًا إشعارًا للأعضاء:

source: send
ar: إرسال

source: Notification Text:
ar: نص الإشعار:

source: Add New Admin
ar: إضافة مشرف جديد

# adminInclude
source: The center includes 3 admin to supervise its members:
ar: يتضمن المركز 3 مشرفين للإشراف على أعضائه:

source: Delete Admin
ar: حذف المشرف

source: Are You Sure !
ar: هل أنت متأكد!

source: Cancel
ar: إلغاء

source: Counter
ar: عداد

source: Edit Subscription
ar: تعديل الاشتراك

source: Center Name:
ar: اسم المركز:

# describe
source: Description:
ar: الوصف:

source: Delete Member
ar: حذف العضو
